In [1]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

In [2]:
# File path to the text file
local_filename = "/kaggle/input/babynamesbystate-zip/CA.TXT"
field_names = ['State', 'Gender', 'Year', 'Name', 'Count']

# Read the CSV file directly
babynamesCA = pd.read_csv(local_filename, header=None, names=field_names)

# Display the first few rows
babynamesCA.head()

  State Gender  Year      Name  Count
0    CA      F  1910      Mary    295
1    CA      F  1910     Helen    239
2    CA      F  1910   Dorothy    220
3    CA      F  1910  Margaret    163
4    CA      F  1910   Frances    134

**Question 1: Retrieve all records for the state 'CA' (California) from the `babynames` dataframe.**

In [3]:
babynamesCA.head()

  State Gender  Year      Name  Count
0    CA      F  1910      Mary    295
1    CA      F  1910     Helen    239
2    CA      F  1910   Dorothy    220
3    CA      F  1910  Margaret    163
4    CA      F  1910   Frances    134

**Modified Question 1: Retrieve all records for the state 'CA' from the babynames dataframe, but exclude the years 1990 and 2000.**

In [4]:
arr = babynamesCA[
    (~babynamesCA['Year'].isin([1990 ,2000])) &
    (babynamesCA['State'] == 'CA')
].head()

arr

  State Gender  Year      Name  Count
0    CA      F  1910      Mary    295
1    CA      F  1910     Helen    239
2    CA      F  1910   Dorothy    220
3    CA      F  1910  Margaret    163
4    CA      F  1910   Frances    134

**Question 2: Find all baby names in California for the year 2000.**

In [5]:
names = babynamesCA[babynamesCA['Year']==2000].loc[:,['Name','Year']]
names

            Name  Year
149062     Emily  2000
149063    Ashley  2000
149064  Samantha  2000
149065   Jessica  2000
149066  Jennifer  2000
...          ...   ...
348605     Zarek  2000
348606       Zen  2000
348607     Zenon  2000
348608    Zuriel  2000
348609      Zyon  2000

[6285 rows x 2 columns]

**Modified Question 2: Find all baby names in California for the year 2000 and sort them in descending order based on the number of occurrences.**

In [6]:
names1 = babynamesCA[babynamesCA['Year']==2000].loc[:,['Name','Count']]
names1.sort_values(by=['Count'] , ascending=False )

              Name  Count
346093      Daniel   4342
346094     Anthony   3840
346095        Jose   3804
346096      Andrew   3600
346097     Michael   3572
...            ...    ...
152465  Francessca      5
152464   Florencia      5
152463    Fiorella      5
152462   Felicitas      5
348609        Zyon      5

[6285 rows x 2 columns]

Read the File NY.txt

In [7]:
# File path to the text file
local_filename = "/kaggle/input/babynamesbystate-zip/NY.TXT"
field_names = ['State', 'Gender', 'Year', 'Name', 'Count']

# Read the CSV file directly
babynamesNY = pd.read_csv(local_filename, header=None, names=field_names)

# Display the first few rows
babynamesNY.head()

  State Gender  Year      Name  Count
0    NY      F  1910      Mary   1923
1    NY      F  1910     Helen   1290
2    NY      F  1910      Rose    990
3    NY      F  1910      Anna    951
4    NY      F  1910  Margaret    926

**Question 3: Get all female baby names for the state of New York ('NY') from the year 1995.**

In [8]:
female_names = babynamesNY[(babynamesNY['Gender'] == 'F') & (babynamesNY['Year'] >= 1965)]
female_names

       State Gender  Year      Name  Count
51771     NY      F  1965      Lisa   5612
51772     NY      F  1965      Mary   3077
51773     NY      F  1965     Karen   3033
51774     NY      F  1965     Susan   2780
51775     NY      F  1965  Patricia   2633
...      ...    ...   ...       ...    ...
181234    NY      F  2023   Zenobia      5
181235    NY      F  2023    Zeynab      5
181236    NY      F  2023      Zion      5
181237    NY      F  2023     Zohra      5
181238    NY      F  2023  Zunaisha      5

[129468 rows x 5 columns]

**Modified Question 3: Get the top 10 female baby names in New York ('NY') from the year 1995 with the highest counts.**

In [9]:
female_names.sort_values(by=['Count'] , ascending = False).head(10)

      State Gender  Year      Name  Count
51771    NY      F  1965      Lisa   5612
63545    NY      F  1972  Jennifer   5523
53330    NY      F  1966      Lisa   5144
61750    NY      F  1971  Jennifer   4962
65311    NY      F  1973  Jennifer   4955
67072    NY      F  1974  Jennifer   4921
54910    NY      F  1967      Lisa   4825
56517    NY      F  1968      Lisa   4435
70721    NY      F  1976  Jennifer   4254
59908    NY      F  1970  Jennifer   4203

# ****You can solve following question for any State (if state is not mentioned)****

**Question 4: Select the first 10 rows from the `babynames` dataframe.**

In [10]:
def ten_rows(df):
    return df.loc[0:10]

# ten_rows(babynamesCA)
ten_rows(babynamesNY)

   State Gender  Year       Name  Count
0     NY      F  1910       Mary   1923
1     NY      F  1910      Helen   1290
2     NY      F  1910       Rose    990
3     NY      F  1910       Anna    951
4     NY      F  1910   Margaret    926
5     NY      F  1910    Dorothy    897
6     NY      F  1910       Ruth    713
7     NY      F  1910    Lillian    648
8     NY      F  1910   Florence    604
9     NY      F  1910    Frances    589
10    NY      F  1910  Elizabeth    579

**Modified Question 4: Select the first 20 rows and only include those rows where the baby count is even.**

In [11]:
def even_count(df):
    return df[df.Count % 2 == 0][0:20]
    

# even_count(babynamesNY)
even_count(babynamesCA)

   State Gender  Year       Name  Count
2     CA      F  1910    Dorothy    220
4     CA      F  1910    Frances    134
5     CA      F  1910       Ruth    128
6     CA      F  1910     Evelyn    126
7     CA      F  1910      Alice    118
11    CA      F  1910      Marie     90
12    CA      F  1910    Mildred     90
13    CA      F  1910       Rose     74
14    CA      F  1910      Hazel     68
16    CA      F  1910  Josephine     66
17    CA      F  1910    Lucille     66
20    CA      F  1910       Edna     62
21    CA      F  1910    Eleanor     60
22    CA      F  1910   Marjorie     60
25    CA      F  1910      Edith     58
26    CA      F  1910      Doris     56
27    CA      F  1910      Irene     56
30    CA      F  1910      Ethel     52
33    CA      F  1910     Esther     44
36    CA      F  1910      Betty     40

**Question 5: Retrieve the 50th to 60th rows and only display the 'State', 'Name', and 'Count' columns.**

In [12]:
babynamesCA.iloc[50:60][['State', 'Name', 'Count']]

   State       Name  Count
50    CA     Myrtle     30
51    CA    Pauline     30
52    CA       Ruby     30
53    CA       Emma     29
54    CA        Eva     29
55    CA  Genevieve     29
56    CA      Sarah     29
57    CA      Anita     28
58    CA        Ida     28
59    CA      Julia     28

**Modified Question 5: Retrieve rows from 50 to 100, but only display the rows where the count is greater than 500 and include only the 'State', 'Name', and 'Count' columns.**

In [13]:
rows = babynamesNY.iloc[50:101]
count=rows[rows['Count'] >50]
display = count[['State', 'Name','Count']]
display.head()

   State       Name  Count
50    NY       Lena    141
51    NY       Emma    140
52    NY        Mae    137
53    NY  Charlotte    133
54    NY      Pearl    129

**Question 6: Get the row at index 100 and display it.**

In [14]:
row_100 =babynamesNY.iloc[100:101]
row_100

    State Gender  Year  Name  Count
100    NY      F  1910  Dora     70

**Modified Question 6: Retrieve the row at index 100, then calculate the sum of all the numeric columns in the dataset for this row.**

In [15]:
row_sum = babynamesNY.iloc[100:101].sum()
row_sum

State       NY
Gender       F
Year      1910
Name      Dora
Count       70
dtype: object

**Question 7: Retrieve the 'Name' and 'Count' columns for the first 5 rows.**

In [16]:
five_rows = babynamesNY.head()
five_rows[['Name', 'Count']]

       Name  Count
0      Mary   1923
1     Helen   1290
2      Rose    990
3      Anna    951
4  Margaret    926

**Modified Question 7: Retrieve the 'Name' and 'Count' columns for the first 10 rows, but only include rows where the name starts with a vowel.**

In [17]:
#function to check vowel
def starts_with_vowel(s):
  return s[0].lower() in 'aeiou'

first_ten = babynamesNY[:10][['Name' , 'Count']]
vowel_names = first_ten[first_ten['Name'].apply(starts_with_vowel)]
# first_ten
vowel_names

   Name  Count
3  Anna    951

In [18]:
first_ten1 = babynamesCA[:10][['Name' , 'Count']]
first_ten1[first_ten1['Name'].apply(starts_with_vowel)]

        Name  Count
6     Evelyn    126
7      Alice    118
9  Elizabeth     93

**Question 8: Find all names in the dataset with a count greater than 1000.**

In [19]:
name_count_10000 = babynamesCA[babynamesCA['Count'] > 1000]['Name']
name_count_10000

1950         Mary
2417         Mary
2894         Mary
3405         Mary
3925         Mary
           ...
411129      Elias
411130    Matthew
411131       Levi
411132      Angel
411133      Dylan
Name: Name, Length: 5981, dtype: object

**Modified Question 8: Find all names in the dataset with a count greater than 5000, but exclude the state 'TX'.**

In [20]:
name_count_10000 = babynamesNY[babynamesNY['Count'] > 5000]['Name']
name_count_10000

2655         Mary
3374         Mary
4106         Mary
4830         Mary
5599         Mary
           ...
249350    Michael
250873    Michael
252459    Michael
254143    Michael
255820    Michael
Name: Name, Length: 269, dtype: object

In [21]:
local_file_path = "/kaggle/input/babynamesbystate-zip/TX.TXT"

field_names = ['State', 'Gender', 'Year', 'Name', 'Count']

# Read the CSV file directly
babynamesTX = pd.read_csv(local_file_path, header=None, names=field_names)

# Display the first few rows
babynamesTX.head()

  State Gender  Year    Name  Count
0    TX      F  1910    Mary    895
1    TX      F  1910    Ruby    314
2    TX      F  1910   Annie    277
3    TX      F  1910  Willie    260
4    TX      F  1910    Ruth    252

**Question 9: Get all baby names that start with the letter 'A' from the state of Texas (TX).**

In [22]:
name_startWith_A = babynamesTX[babynamesTX['Name'].str.startswith('A')]
name_startWith_A

       State Gender  Year     Name  Count
2         TX      F  1910    Annie    277
22        TX      F  1910    Alice    149
40        TX      F  1910     Anna    117
41        TX      F  1910     Alma    116
76        TX      F  1910      Ada     63
...      ...    ...   ...      ...    ...
382353    TX      M  2023   Ayrton      5
382354    TX      M  2023    Ayson      5
382355    TX      M  2023   Azaias      5
382356    TX      M  2023  Azariel      5
382357    TX      M  2023    Azeem      5

[40502 rows x 5 columns]

**Question 10: Get the first 5 rows for the state 'CA', then select only the 'Year', 'Name', and 'Count' columns.**

In [23]:
five_rows_CA = babynamesCA[:5]
five_rows_CA[['Year', 'Name', 'Count' ]]

   Year      Name  Count
0  1910      Mary    295
1  1910     Helen    239
2  1910   Dorothy    220
3  1910  Margaret    163
4  1910   Frances    134